; domain
(define (domain gripper-strips)
 (:requirements :strips :typing :constraints) 
 (:types type_1 object type_2 type_3)
 (:predicates (pred_3 ?v5 - type_2 ?v1 - type_1)
 	      (pred_1 ?v2 - object ?v1 - type_1)
	      (pred_4 ?v5 - type_2 ?v8 - type_3)
	      (pred_2 ?v5 - type_2 ?v2 - object ?v8 - type_3))

   (:action op_1
       :parameters  (?v5 - type_2 ?v3 ?v4 - type_1)
       :precondition (and  (pred_3 ?v5 ?v3))
       :effect (and  (pred_3 ?v5 ?v4)
		     (not (pred_3 ?v5 ?v3))))

   (:action op_2
       :parameters (?v5 - type_2 ?v6 - object ?v7 - type_1 ?v8 - type_3)
       :precondition  (and  (pred_1 ?v6 ?v7) (pred_3 ?v5 ?v7) (pred_4 ?v5 ?v8))
       :effect (and (pred_2 ?v5 ?v6 ?v8)
		    (not (pred_1 ?v6 ?v7)) 
		    (not (pred_4 ?v5 ?v8))))

   (:action op_3
       :parameters (?v5 - type_2 ?v6 - object ?v7 - type_1 ?v8 - type_3)
       :precondition  (and  (pred_2 ?v5 ?v6 ?v8) (pred_3 ?v5 ?v7))
       :effect (and (pred_1 ?v6 ?v7)
		    (pred_4 ?v5 ?v8)
		    (not (pred_2 ?v5 ?v6 ?v8)))))

; problem
(define (problem gripper-2-4-4)
(:domain gripper-strips)
(:objects obj_10 obj_08 - type_2
obj_12 obj_13 obj_02 obj_14 - type_3
obj_07 obj_04 obj_09 obj_01 - type_1
obj_03 obj_05 obj_11 obj_06 - object)
(:init
(pred_3 obj_10 obj_01)
(pred_4 obj_10 obj_12)
(pred_4 obj_10 obj_13)
(pred_3 obj_08 obj_04)
(pred_4 obj_08 obj_02)
(pred_4 obj_08 obj_14)
(pred_1 obj_03 obj_09)
(pred_1 obj_05 obj_04)
(pred_1 obj_11 obj_01)
(pred_1 obj_06 obj_04)
)
(:goal
(and
(pred_1 obj_03 obj_07)
(pred_1 obj_05 obj_09)
(pred_1 obj_11 obj_01)
(pred_1 obj_06 obj_01)
)
)

(:constraints
  (always (not (pred_3 obj_10 obj_09)))
)
)

; plan
1. (op_1 obj_10 obj_01 obj_07)
   deleted: (pred_3 obj_10 obj_01)
   added: (pred_3 obj_10 obj_07)
   goals met: 1 of 4
2. (op_2 obj_08 obj_06 obj_04 obj_14)
   deleted: (pred_1 obj_06 obj_04) (pred_4 obj_08 obj_14)
   added: (pred_2 obj_08 obj_06 obj_14)
   goals met: 1 of 4
3. (op_2 obj_08 obj_05 obj_04 obj_02)
   deleted: (pred_1 obj_05 obj_04) (pred_4 obj_08 obj_02)
   added: (pred_2 obj_08 obj_05 obj_02)
   goals met: 1 of 4
4. (op_1 obj_08 obj_04 obj_01)
   deleted: (pred_3 obj_08 obj_04)
   added: (pred_3 obj_08 obj_01)
   goals met: 1 of 4
5. (op_3 obj_08 obj_06 obj_01 obj_14)
   deleted: (pred_2 obj_08 obj_06 obj_14)
   added: (pred_1 obj_06 obj_01) (pred_4 obj_08 obj_14)
   goals met: 2 of 4
6. (op_1 obj_08 obj_01 obj_09)
   deleted: (pred_3 obj_08 obj_01)
   added: (pred_3 obj_08 obj_09)
   goals met: 2 of 4
7. (op_3 obj_08 obj_05 obj_09 obj_02)
   deleted: (pred_2 obj_08 obj_05 obj_02)
   added: (pred_1 obj_05 obj_09) (pred_4 obj_08 obj_02)
   goals met: 3 of 4
8. (op_2 obj_08 obj_03 obj_09 obj_14)
   deleted: (pred_1 obj_03 obj_09) (pred_4 obj_08 obj_14)
   added: (pred_2 obj_08 obj_03 obj_14)
   goals met: 3 of 4
9. (op_1 obj_08 obj_09 obj_07)
   deleted: (pred_3 obj_08 obj_09)
   added: (pred_3 obj_08 obj_07)
   goals met: 3 of 4
10. (op_3 obj_08 obj_03 obj_07 obj_14)
   deleted: (pred_2 obj_08 obj_03 obj_14)
   added: (pred_1 obj_03 obj_07) (pred_4 obj_08 obj_14)
   goals met: 4 of 4
